InformationRegisters/ИдентификаторыEStaff.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыEStaff</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииОКандидатах</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кандидаты</v8:Type>
						<v8:Type>cfg:CatalogRef.Вакансии</v8:Type>
						<v8:Type>cfg:CatalogRef.ПричиныОткрытияВакансий</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеДанныеКандидатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыEStaff/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляУправленческихДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОбъектПоИдентификатору(Идентификатор) Экспорт
	
	Объект = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ИдентификаторыEStaff.ИдентификаторОбъекта КАК Идентификатор,
	|	ИдентификаторыEStaff.ОбъектСсылка КАК Ссылка
	|ИЗ
	|	РегистрСведений.ИдентификаторыEStaff КАК ИдентификаторыEStaff
	|ГДЕ
	|	ИдентификаторыEStaff.ИдентификаторОбъекта = &Идентификатор";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Объект = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

#КонецОбласти

#КонецЕсли
